---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodRayEllipseZ2x
source: html/8134cbf1-618b-b2d6-f8f9-7eba53b3046a.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodRayEllipseZ2x Property

The property labeled "Ratio between two radii of ray ellipse" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodRayEllipseZ2x { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".